## 1. Create a DataFrame with Missing Values

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [14]:
data = {
    'Name': ['Nikunj', 'Aman', 'Vyom', 'Ronak', 'Defaulter'],
    'Age': [25, np.nan, 35, 40, np.nan],
    'Score': [85, 90, np.nan, 88, 70]
}

df = pd.DataFrame(data)

##  2. Detect Missing Data

In [15]:
df.isnull()

    Name    Age  Score
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False
4  False   True  False

In [16]:
df.isnull().sum()

Name     0
Age      2
Score    1
dtype: int64

 ## 3. Drop Missing Data

In [17]:
df.dropna()

     Name   Age  Score
0  Nikunj  25.0   85.0
3   Ronak  40.0   88.0

In [18]:
df.dropna(axis =1)

        Name
0     Nikunj
1       Aman
2       Vyom
3      Ronak
4  Defaulter

In [19]:
df.dropna(thresh =2)

        Name   Age  Score
0     Nikunj  25.0   85.0
1       Aman   NaN   90.0
2       Vyom  35.0    NaN
3      Ronak  40.0   88.0
4  Defaulter   NaN   70.0

##  4. Fill Missing Data

In [20]:
df.fillna(0)

        Name   Age  Score
0     Nikunj  25.0   85.0
1       Aman   0.0   90.0
2       Vyom  35.0    0.0
3      Ronak  40.0   88.0
4  Defaulter   0.0   70.0

In [21]:
df['Age'].fillna(df['Age'].mean())

0    25.000000
1    33.333333
2    35.000000
3    40.000000
4    33.333333
Name: Age, dtype: float64

## 5. Forward Fill / Backward Fill

In [22]:
df.fillna(method='ffill') 
df.fillna(method='bfill')

C:\Users\DELL\AppData\Local\Temp\ipykernel_1060\3876251540.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')
C:\Users\DELL\AppData\Local\Temp\ipykernel_1060\3876251540.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

        Name   Age  Score
0     Nikunj  25.0   85.0
1       Aman  35.0   90.0
2       Vyom  35.0   88.0
3      Ronak  40.0   88.0
4  Defaulter   NaN   70.0

## 6. Interpolation (Estimates Between Values)

print(df.interpolate())

##  7. Replace Values (Not Just NaN)

In [23]:
df.replace(85, 999)

        Name   Age  Score
0     Nikunj  25.0  999.0
1       Aman   NaN   90.0
2       Vyom  35.0    NaN
3      Ronak  40.0   88.0
4  Defaulter   NaN   70.0